In [ ]:
import pandas as pd

print('running')

df = pd.read_csv("titanic_cleaned.csv")

df.head(10)

In [20]:
import pandas as pd2

print('running')

df = pd2.read_csv("titanic_cleaned.csv")

#task 5
#output the new dataframe df_2 that has columns survives name age fare.
#df2 = df.loc[:, ['Survived', 'Name', 'Age', 'Fare']] 

def age_class (row):
    if row['Age'] < 18:
        return "child"
    else:
        return "adult"

df2 = (df.loc[df['Age'] > 10].filter(['Survived', 'Age', 'Name', 'Fare']))
df2['Age Class'] = df2.apply(age_class, axis=1)
df2

running

,Survived,Age,Name,Fare,Age Class
0,0,22.0,Mr. Owen Harris Braund,7.2500,adult
1,1,38.0,Mrs. John Bradley (Florence Briggs Thayer) Cum...,71.2833,adult
2,1,26.0,Miss. Laina Heikkinen,7.9250,adult
3,1,35.0,Mrs. Jacques Heath (Lily May Peel) Futrelle,53.1000,adult
4,0,35.0,Mr. William Henry Allen,8.0500,adult
...,...,...,...,...,...
881,0,39.0,Mrs. William (Margaret Norton) Rice,29.1250,adult
882,0,27.0,Rev. Juozas Montvila,13.0000,adult
883,1,19.0,Miss. Margaret Edith Graham,30.0000,adult
885,1,26.0,Mr. Karl Howell Behr,30.0000,adult
886,0,32.0,Mr. Patrick Dooley,7.7500,adult

# title

above is an iloc

create a new dataframe df_2 that has columns survives name age fare.